app/views/tasks/create.js.erb

INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-05-22 10:09:39.622461"], ["updated_at", "2019-05-22 10:09:39.622461"], ["title", "Youpi"], ["deadline", "2019-05-23 00:00:00"], ["category_id", 1]]
---
// We grab the category title and we add the new <li> created by the task_form
document.getElementById("<%= @category.title %>").insertAdjacentHTML("beforeend", "<%= j render 'task', task: @task %>");