app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails"
---
  def index
  	@emails = Email.all.reverse

INSERT INTO "emails" ("object", "body", "created_at", "updated_at", "wasread") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    # Creation d'un nouvel e-mail
    @email = Email.create(
      object: Faker::Lorem.sentence(4),
      body: Faker::Lorem.paragraph(20),
      wasread: false
      )

SELECT "emails".* FROM "emails"
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 56], ["LIMIT", 1]]
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 98]]
---
  def destroy
    @emails = Email.all.reverse
    @email = Email.find(params[:id])

    @email.destroy

SELECT "emails".* FROM "emails"
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]
UPDATE "emails" SET "wasread" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["wasread", true], ["updated_at", "2019-05-23 16:46:25.122235"], ["id", 116]]
---
  def show
    @emails = Email.all.reverse
    @email = Email.find(params[:id])
    @email.update(wasread: true)