app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @category = Category.find(category_params)
    @task.category = @category
    if @task.save
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-05-22 09:50:16.475601"], ["updated_at", "2019-05-22 09:50:16.475601"], ["title", "test format html"], ["deadline", "2019-05-22 00:00:00"], ["category_id", 2]]

  def update
    @task = Task.find(params[:id])

    # If the box is actived and the box is checked, the param :name has the value 1, so we pass it to true
    # else, it means it is unchecked, and status goes to false.
    if (task_params[:name] == "1")
      @task.update(status: true)
    else
      @task.update(status: false)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", true], ["updated_at", "2019-05-22 15:22:37.656658"], ["id", 1]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", false], ["updated_at", "2019-05-22 15:21:44.497023"], ["id", 1]]

  def index
    @tasks = Task.all
    @category = Category.find(category_params)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 10]]