app/views/emails/create.js.erb


document.getElementById("emails-list").insertAdjacentHTML("beforeend", "<%= j render 'email', email: @email %>");
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at", "wasread") VALUES ($1, $2, $3, $4, $5) RETURNING "id"